public/man/man1/colcrt.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - colcrt.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - colcrt.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>colcrt - filter nroff output for CRT previewing</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>colcrt</strong> [options] [/file/ …]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>colcrt</strong> provides virtual half-line and reverse line feed sequences for
terminals without such capability, and on which overstriking is
destructive. Half-line characters and underlining (changed to dashing
`-) are placed on new lines in between the normal output lines.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-</strong>, <strong>–no-underlining</strong></p>
<blockquote>
<p>Suppress all underlining. This option is especially useful for
previewing <em>allboxed</em> tables from *tbl*(1).</p>
</blockquote>
<p>
<strong>-2</strong>, <strong>–half-lines</strong></p>
<blockquote>
<p>Causes all half-lines to be printed, effectively double spacing the
output. Normally, a minimal space output format is used which will
suppress empty lines. The program never suppresses two consecutive empty
lines, however. The <strong>-2</strong> option is useful for sending output to the line
printer when the output contains superscripts and subscripts which would
otherwise be partially invisible.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Print version and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
HISTORY
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The <strong>colcrt</strong> command appeared in 3.0BSD.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Should fold underlines onto blanks even with the <strong>-</strong> option so that a
true underline character would show.</p>
<p>
Can&#39;t back up more than 102 lines.</p>
<p>
General overstriking is lost; as a special case | overstruck with - or
underline becomes +.</p>
<p>
Lines are trimmed to 132 characters.</p>
<p>
Some provision should be made for processing superscripts and subscripts
in documents which are already double-spaced.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
EXAMPLES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>A typical use of <strong>colcrt</strong> would be:</p>
<blockquote>
<p><strong>tbl exum2.n | nroff -ms | colcrt - | more</strong>\\</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
SEE ALSO
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>*col*(1), *more*(1), *nroff*(1), *troff*(1), *ul*(1)</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
REPORTING BUGS
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
AVAILABILITY
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>The <strong>colcrt</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
